In [1]:
import pandas as pd

In [2]:
data = {
    'Name':['Alice','Bob','Clarlie','David','Eve'],
    'Age':[25,32,18,47,33],
    'City':['New York','Paris','London','Tokyo','Sydney']
}

In [3]:
df = pd.DataFrame(data)

In [4]:
names = df['Name']

In [5]:
names

0      Alice
1        Bob
2    Clarlie
3      David
4        Eve
Name: Name, dtype: object

In [6]:
name_city = df[['Name','City']]

In [7]:
name_city

      Name      City
0    Alice  New York
1      Bob     Paris
2  Clarlie    London
3    David     Tokyo
4      Eve    Sydney

.loc[]

In [8]:
single_row = df.loc[2]

In [9]:
list_rows = df.loc[[0,3,4]]

In [10]:
column_list = df.loc[:,['Name','Age']]

In [12]:
print(single_row)
print()
print(list_rows)
print()
print(column_list)
print()

Name    Clarlie
Age          18
City     London
Name: 2, dtype: object

    Name  Age      City
0  Alice   25  New York
3  David   47     Tokyo
4    Eve   33    Sydney

      Name  Age
0    Alice   25
1      Bob   32
2  Clarlie   18
3    David   47
4      Eve   33

Slicing using .loc[]

In [13]:
slice_rows = df.loc[1:3]

Endpoints are Inclusive i.e, Both 1 and 3 positions are included

In [16]:
slice_columns = df.loc[:,'Name':'Age']

In [17]:
print(slice_rows)
print()
print(slice_columns)

      Name  Age    City
1      Bob   32   Paris
2  Clarlie   18  London
3    David   47   Tokyo

      Name  Age
0    Alice   25
1      Bob   32
2  Clarlie   18
3    David   47
4      Eve   33

Boolean Indexing with .loc[]

In [18]:
boolean_index = df.loc[df['Age']> 30]

In [19]:
print(boolean_index)

    Name  Age    City
1    Bob   32   Paris
3  David   47   Tokyo
4    Eve   33  Sydney

.iloc[]

In [20]:
single_row = df.iloc[2]

In [21]:
row_list=df.iloc[[0,3,4]]

In [22]:
column_list = df.iloc[:,[0,2]]

In [23]:
specific_value = df.iloc[1,0]

In [24]:
print("Single Row:")
print(single_row)
print()
print("List of Rows:")
print(row_list)
print()
print("List of Columns:")
print(column_list)
print()
print("Specific Value:")
print(specific_value)

Single Row:
Name    Clarlie
Age          18
City     London
Name: 2, dtype: object

List of Rows:
    Name  Age      City
0  Alice   25  New York
3  David   47     Tokyo
4    Eve   33    Sydney

List of Columns:
      Name      City
0    Alice  New York
1      Bob     Paris
2  Clarlie    London
3    David     Tokyo
4      Eve    Sydney

Specific Value:
Bob

Slicing using .iloc[]

In [25]:
slice_rows = df.iloc[1:4]

Notice that the position 4 is not inclusive in df.iloc[1:4].

In [28]:
slice_column = df.iloc[:,0:2]

Notice that the position 2 is not inclusive in df.iloc[:,0:2].

In [27]:
print(slice_rows)
print()
print(slice_column)
print()

      Name  Age    City
1      Bob   32   Paris
2  Clarlie   18  London
3    David   47   Tokyo

      Name  Age
0    Alice   25
1      Bob   32
2  Clarlie   18
3    David   47
4      Eve   33